# RESTとは
Representational StateTransfer -> Webサービスの設計モデル
RESTなWebサービスは、そのサービスのURIにHTTPメソッドでアクセスすることでデータの送受信を行う
APIが提供しているリソースの取得(GET), リソースの登録(POST), 更新(PUT/PATCH), 削除(DELETE)がRESTにより実現できる
公開されているAPIサービスとそれで得られデータとを自分で作成したシステムを組み合わせて新しいWebサービスを作成できるのかがRESTの素晴らしいところ

# RESTの設計原則であるRESTful
RESTの設計原則
- アドレス指定可能なURIで公開されていること
- インターフェース(HTTPメソッドの利用)の統一がされていること
- ステートレスであること
- 処理結果がHTTPステータスコードで通知されること

これらの原則に伴ったWebサービスをRESTfulなサービスという

## アドレス指定可能なURI
URIはあくまでもリソースを示すべきのみなので、名詞のみで構成されることが原則
例 /api/getUsers　ではなく、 /api/users とする。

## インターフェース統一
| 処理 | HTTPメソッド | CRUD操作 |
| ---- | ---- | ---- |
| 登録 | POST | CREATE |
| 取得 | GET | READ |
| 更新 | PUT | UPDATE |
| 削除 | DELETE | DELETE |

## ステートレス
ストートレスなやりとりにおいてサーバーはクライアントのセッション情報を保持しない
逆にステートフルなやりとりでは、セッション情報は保持される

## 処理結果をHTTPステータスコードで返す
ステータスコードはWebサービスからのレスポンスを表すコード

|コード|状態|説明|
|----|----|----|
|200|OK|リクエストが正常に処理された|
|201|Created|リクエストが正常に処理されて、新規リソースが作成された|
|204|No content| リクエストが正常に処理されたが、返す新規情報はない|
|400|Bad Resquet|サーバーが理解できない無効な要求|
|401|Unauthorized|要求されたリソースに認証が必要である|
|403|Forbidden|要求されたリクエストは拒否された|
|404|Not Found|要求されたリソースサーバは存在しない|
|500|Internal Server Error|サーバーでエラーが発生した|

